class ltcl_test_for_nwf_100 definition final for testing
  duration short
  risk level harmless.
  private section.
    methods:
      "! 実データからの作業区能力算出｜製造指図
      sample_4_manufacturing_order  for testing,
      "! 実データからの作業区能力算出｜製造バージョン
      sample_4_production_version   for testing.
endclass.


class ltcl_test_for_nwf_100 implementation.

  method sample_4_manufacturing_order.
**********************************************************************
*   製造指図 92000920
**********************************************************************
*   作業 0010｜作業区 Z701｜管理キー Z001｜標準作業数量2
*   作業 0020｜作業区 Z702｜管理キー Z101｜標準作業数量2
*   作業 0100｜作業区 Z703｜管理キー Z201｜標準作業数量2
*   作業 0300｜作業区 Z704｜管理キー Z202｜標準作業数量2 08:00:00 H
*   作業 0800｜作業区 Z799｜管理キー Z301｜標準作業数量2 08:00:00 H
*   作業 0810｜作業区 Z705｜管理キー Z201｜標準作業数量2 08:00:00 H｜対象
**********************************************************************
*   作業区 Z704｜能力カテゴリ Z1｜稼働時間 8:00｜能力利用度 100｜個別能力数 1｜能力数量単位 H｜8.00 * 100/100 * 1 / 8.00 = 1
*   作業区 Z799｜能力カテゴリ Z1｜稼働時間 8:00｜能力利用度 100｜個別能力数 1｜能力数量単位 H｜8.00 * 100/100 * 1 / 8.00 = 1
*   作業区 Z705｜能力カテゴリ Z1｜稼働時間 8:00｜能力利用度 100｜個別能力数 1｜能力数量単位 H｜8.00 * 100/100 * 1 / 8.00 = 1
**********************************************************************
*   期待値 1[days]
**********************************************************************
    try.
      data(ro_runtime) = zcl_calculating_mfg_operations=>create_by_manufacturing_order( '000092000920' ).
      data(lv_days)    = ro_runtime->aggregate_standard_capacitiy( ).
      cl_abap_unit_assert=>assert_equals( act = lv_days exp = 1 ).
    catch zcx_no_data.
    endtry.
  endmethod.


  method sample_4_production_version.
**********************************************************************
*   品目 ZSF00001｜プラント 7002｜製造バージョン A001
**********************************************************************
*   作業グループ 50000009｜作業グループカウンタ 1｜作業タイプ N｜順序 0
**********************************************************************
*   作業 0010｜作業区 Z7001｜管理キー Z001｜標準作業数量2  0 H
*   作業 0020｜作業区 Z7002｜管理キー Z101｜標準作業数量2  0 H
*   作業 0100｜作業区 Z7003｜管理キー Z201｜標準作業数量2 10 H｜対象
*   作業 0300｜作業区 Z7004｜管理キー Z202｜標準作業数量2  8 H｜対象
*   作業 0800｜作業区 Z7999｜管理キー Z301｜標準作業数量2  8 H｜対象
*   作業 0810｜作業区 Z7005｜管理キー Z203｜標準作業数量2  8 H｜対象
**********************************************************************
*   作業区 Z201｜能力カテゴリ Z1｜稼働時間 8:00｜能力利用度 100｜個別能力数 1｜能力数量単位 H｜8.00 * 100/100 * 1 / 10.00 = 0.8
*   作業区 Z202｜能力カテゴリ Z1｜稼働時間 8:00｜能力利用度 100｜個別能力数 1｜能力数量単位 H｜8.00 * 100/100 * 1 /  8.00 = 1
*   作業区 Z301｜能力カテゴリ Z1｜稼働時間 8:00｜能力利用度 100｜個別能力数 1｜能力数量単位 H｜8.00 * 100/100 * 1 /  8.00 = 1
*   作業区 Z203｜能力カテゴリ Z1｜稼働時間 8:00｜能力利用度 100｜個別能力数 1｜能力数量単位 H｜8.00 * 100/100 * 1 /  8.00 = 1
**********************************************************************
*   期待値 0.8 + 1 + 1 + 1 = 3.8[days] →（切り上げ）→ 4[days]
**********************************************************************
    try.
      data(ro_runtime) = zcl_calculating_mfg_operations=>create_by_production_version( im_product = 'ZSF00001' im_plant = '7002' im_version = 'A001' ).
      data(lv_days)    = ro_runtime->aggregate_standard_capacitiy( ).
      cl_abap_unit_assert=>assert_equals( act = lv_days exp = 4 ).
    catch zcx_no_data.
    endtry.
  endmethod.

endclass.
